#problem4
a = 17 * 3
b = 12 * 5
print("Что больше 17*3 или 12*5")
print("Выражение a == ", a)
print("Выражение b == ",b)
print((17*3) > (12*5))
a = 12**3
b = 13*7
print("Что больше 12**3 или 13*7")
print("Выражение a == ", a)
print("Выражение b == ", b)
print((17**3) > (12*5)) 
a = 4**5
b = 512+512
print("Что больше 4**5 или 512+512")
print("Выражение a == ", a)
print("Выражение b == ", b)
print((4**5) > (512+512))

#Problem1
a = 17925
b = 34**2
print("Выражение a == ", a)
print("Выражение b == ", b)
print("Что больше 17925 или 34**2")
print(17925 >= (34**2))
a = 17925
b = 26*3
print("Выражение a == ", a)
print("Выражение b == ", b)
print("Что больше 17925 или 26*3")
print(17925 > (26*3))
a = 17925
b = 17*33
print("Выражение a == ", a)
print("Выражение b == ", b)
print("Что больше 17925 или 17*33")
print(17925 >= (17*33))
a = 17925
b = 4394*4
print("Выражение a == ", a)
print("Выражение b == ", b)
print("Что больше 17925 или 4394*4")
print(17925 >= (4394*4))
#Problem3
print(((13+25)*3)**2-193432)

#Problem2
a = 10
b = 3
c = 18
print("Выражение a == ", a)
print("Выражение b == ", b)
print("Выражение c == ", c)
print((a>b)<c)

print((7%3)*4,8)

a = 155+145
b = 125+175
print("Выражение a == ", a)
print("Выражение b == ", b)
print((155+145) == (125+175))

a = 144-35
b = 230+56
print("Выражение a == ", a)
print("Выражение b == ", b)
print((144-35) == (230+56))

#Problem5
print(-21//10)

#Problem9
a = 1992
b = 2021
print((2021-1992)+2)
print((2021-1992)-2)

#Problem8
a = 21
b = 100
print((21/100)*100)

#Problem10
a = 25
b = 75
c = 10
d = 95
print((25+75+10+95)/4)

#Problem17
a = 3.17
b = 3.17
c = 3.17
print((3.17+3.17)*3.17)

#Problem14
a = 4
b = 11
c = 2.5
d = 9
e = 6

#Problem13
print((4-6**(11/9))%2.5)
